{
  "Metadata": {
    "title": "AMH Developments",
    "description": "Your destination for exceptional Business Development solutions."
  },
  "Header": {
    "home": "Home",
    "whoWeAre": "Who We Are",
    "ourTeam": "Our Team",
    "whatWeDo": "What We Do",
    "contactUs": "Contact Us"
  },
  "Footer": {
    "message": "Join the Success!",
    "contact": "Contact Info",
    "address1": "address",
    "address2": "29 Block 3, First Sector, Zahraa Al Maadi, Cairo",
    "contactUs": "Contact Us"
  },
  "Home": {
    "title1": "Welcome To A.M.H For",
    "title2": "Business Development",
    "subtitle": "Your destination for exceptional Business Development solutions",
    "getStarted": "Get Started",
    "subscribe": "Subscribe to Our Newsletter",
    "enterEmail": "Enter your email address",
    "subscribeButton": "Subscribe",
    "thankYou": "Thank You for Subscribing!",

    "aboutTitle1": "About A.M.H For",
    "aboutTitle2": "Developments",
    "aboutSubtitle": "Empowering Your Business To Success",
    "aboutDescription": "At A.M.H., we are committed to empowering your business to thrive in today’s competitive landscape. Our strategic approach is designed to unlock your full potential and drive sustainable growth. With personalized strategies and expert guidance, we ensure that you have the tools and insights needed to seize opportunities and navigate challenges effectively. Partner with A.M.H. to elevate your business development efforts and achieve enduring success.",
    "discoverMore": "Discover More",

    "benefitsTitle1": "Why Choose",
    "benefitsTitle2": "A.M.H",
    "benefitsTitle3": "For Your",
    "benefitsTitle4": "Business?",
    "provenExpertise": "Proven Expertise",
    "provenExpertiseDesc": "AMH has a strong track record in business development, demonstrated through successful client engagements and industry-specific knowledge.",
    "tailoredStrategies": "Tailored Strategies",
    "tailoredStrategiesDesc": "They offer customized solutions that address our specific business challenges and align with our strategic goals.",
    "networkPartnerships": "Network and Partnerships",
    "networkPartnershipsDesc": "AMH provides access to extensive networks and strategic partnerships, facilitating market expansion and growth opportunities.",
    "marketInsights": "Market Insights",
    "marketInsightsDesc": "Their deep understanding of market trends and competitive landscapes informs strategic decision-making and enhances market positioning.",
    "focusedSupport": "Focused Support",
    "focusedSupportDesc": "Partnering with AMH allows us to concentrate on core business operations while benefiting from specialized business development expertise.",
    "resultsOriented": "Results-Oriented Approach",
    "resultsOrientedDesc": "They deliver measurable results, supporting our aim to achieve sustainable growth and operational excellence.",
    "professionalGuidance": "Professional Guidance",
    "professionalGuidanceDesc": "AMH serves as a strategic advisor, guiding us through complex business environments and optimizing business performance.",

    "blogTitle": "Insights & Resources",
    "blogContent": "We combine insightful strategies with valuable resources to empower your business development journey. Our commitment lies in providing you with the essential tools and knowledge needed to navigate challenges, seize opportunities, and achieve sustainable growth. With our comprehensive expertise and dedicated support, we ensure every decision is backed by clarity and confidence.",
    "blogAction": "Explore More",

    "quote": "“Business development is the art of fostering growth through strategic insight, innovative thinking, and unwavering dedication. It’s about navigating opportunities with precision and seizing them with courage, ensuring every step forward is a testament to vision and resilience.”",

    "servicesTitle": "Our Services",
    "servicesDescription": "Explore the comprehensive suite of business development services offered at A.M.H. From strategic planning and market analysis to partnership cultivation and digital transformation, we provide holistic support to meet your varied business needs. Whether you’re expanding into new markets or enhancing operational efficiencies, A.M.H. delivers tailored solutions backed by expertise to propel your business forward.",
    "corporateGovernance": "Corporate Governance Consultation",
    "operationsResearch": "Operations Research Consultation",
    "strategicConsultation": "Strategic Consultation",
    "corporateFinance": "Corporate Finance Consultation",
    "salesMarketing": "Sales & Marketing Consultation",
    "supplyChain": "Supply Chain Consultation"
  },
  "Contact": {
    "contactUs": "Contact Us",
    "addressTitle": "Address",
    "addressLine1": "29 Block 3, First Sector",
    "addressLine2": "Zahraa Al Maadi, Cairo",
    "contactTitle": "Contact",
    "phoneNumber1": "+201003020",
    "email": "a.m.hbusinessdev@gmail.com",
    "openingHoursTitle": "Opening Hours",
    "openingDays": "Sun - Thurs",
    "openingHours": "8:00 am - 8:00 pm",

    "getInTouch": "Get in Touch",
    "yourQuestionsAnswered": "Your questions, answered",
    "firstName": "First Name",
    "lastName": "Last Name",
    "emailAddress": "Email Address",
    "phoneNumber2": "Phone Number",
    "leaveUsAMessage": "Leave Us a Message",
    "sendMessage": "Send Message",
    "messageReceived": "We've received your message!"
  },
  "WhatWeDo": {
    "goBack": "Go Back",
    "ourFieldsTitle": "Our Fields",
    "unlockPotential": "Unlock Your True Business Potential",
    "learnMore": "Learn More",
    "trainingAndDevelopment": "Training and Development Consultation",
    "trainingAndDevelopmentContent1": "Talent development is an essential part of any organization that aims to achieve sustainable success and is no longer an add-on.",
    "trainingAndDevelopmentContent2": "As long as employees are the main driver of any organizational performance, developing the competencies and skills of employees gives organizations the competitive advantage they need to meet the challenges of the present and the future.",
    "trainingAndDevelopmentContent3": "Successful companies realize the importance of continuing to train their employees to enable them to carry out their roles and responsibilities more effectively. However, some companies provide training and professional qualification to employees in isolation from the actual needs of the company or the employee or those that bridge the gap in their skills and experience.",
    "trainingAndDevelopmentContent4": "Hence, the analysis of training needs has become a challenge facing companies that want to excel to determine where there are skills gaps, what training is required, and how to ensure that training achieves the planned goals at the lowest possible cost and achieve the best return on investment.",
    "educationAndDevelopmentServices": "Education and development services include, but are not limited to:",
    "competencyGapAnalysis": "Competency Gap Analysis",
    "trainingCurricula": "Development of building training curricula",
    "experientialLearning": "Experiential learning",
    "practicalWorkshops": "Practical workshops to develop personnel and systems",
    "administrativeSkills": "Develop administrative and practical skills",
    "strategicConsultation": "Strategic Consultation",
    "strategicConsultationContent1": "We provide our clients with strategic advice in all work activities, starting from analyzing the internal elements of the organization and the external elements affecting the performance of the institution.",
    "strategicConsultationContent2": "Determining the appropriate type of strategy for the organization and defining the company's general goals, detailed goals and action plans that achieve strategic, tactical and operational goals.",
    "strategicConsultationContent3": "We offer to provide our customers with innovative solutions that work on developing the institution, raising performance and creating an added value.",
    "strategicConsultationContent4": "We work in cooperation with our clients to allocate resources effectively in order to provide the best investment opportunities for our clients, which improves institutional performance and improves the competitive position.",
    "strategicConsultationContent5": "Management of multi-activities business and investment strategies.",
    "operationsResearch": "Operations Research Consultation",
    "operationsResearchContent1": "Operations management is one of the main lists on which the company is based to achieve its goals, so we study the efficiency of the company's work systems and keep pace with the strategic and operational challenges it faces in various departments, and these services include, for example:",
    "operationsResearchContent2": "Strategic planning using Development of programs Balanced Score card and operational plans.",
    "operationsResearchContent3": "Develop executive action plans Evaluate and develop institutional performance by Using Competencies Management.",
    "operationsResearchContent4": "Re-Engineering Process Analyze and Measure Productivity and Develop Strategies for its Development By using OEE Methodologies.",
    "operationsResearchContent5": "Measure, analyze and control Waste analysis and elimination operating cost By using Lean manufacturing.",
    "operationsResearchContent6": "Preparing the Operations Manual (Operation Manual).",
    "corporateFinance": "Corporate Finance Consultation",
    "corporateFinanceContent1": "In today's dynamic business environment, companies are increasingly recognizing the importance of having sound financial management strategies to ensure sustainable growth and profitability.",
    "corporateFinanceContent2": "We offer comprehensive corporate finance consultation services, designed to help your organization navigate through complex financial challenges.",
    "corporateFinanceContent3": "Financial Analysis and Planning",
    "corporateFinanceContent4": "Capital Structuring and Fundraising",
    "corporateFinanceContent5": "Mergers and Acquisitions",
    "corporateFinanceContent6": "Valuation Services",
    "corporateFinanceContent7": "Risk Management",
    "corporateFinanceContent8": "Financial Restructuring",
    "corporateFinanceContent9": "Investment Analysis and Portfolio Management",
    "supplyChain": "Supply Chain Management",
    "supplyChainContent1": "Effective supply chain management is critical to an organization's operational efficiency and overall success.",
    "supplyChainContent2": "We provide expert consultation services to optimize your supply chain processes, ensuring smooth and cost-effective operations.",
    "supplyChainContent3": "Our services include:",
    "supplyChainContent4": "Supply Chain Strategy Development",
    "supplyChainContent5": "Logistics and Distribution Optimization",
    "supplyChainContent6": "Inventory Management",
    "supplyChainContent7": "Supplier Relationship Management",
    "corporateGovernance": "Corporate Governance",
    "corporateGovernanceContent1": "Corporate governance refers to the system by which companies are directed and controlled.",
    "corporateGovernanceContent2": "We offer governance consulting to help organizations establish strong governance frameworks that promote accountability and transparency.",
    "corporateGovernanceContent3": "Our services include:",
    "corporateGovernanceContent4": "Board Structure and Functioning",
    "corporateGovernanceContent5": "Governance Policies and Procedures",
    "corporateGovernanceContent6": "Compliance and Risk Management",
    "corporateGovernanceContent7": "Stakeholder Engagement",
    "corporateGovernanceContent8": "Ethical Leadership",
    "corporateGovernanceContent9": "Corporate Social Responsibility",
    "governanceConsulting": "Governance Consulting Services:",
    "governanceConsulting1": "Governance framework development",
    "governanceConsulting2": "Policy and procedure design",
    "governanceConsulting3": "Compliance assessments",
    "governanceConsulting4": "Risk management strategies",
    "governanceConsulting5": "Board effectiveness evaluations",
    "governanceConsulting6": "Stakeholder engagement strategies",
    "hrConsulting": "Human Resource Consulting Services:",
    "hrConsulting1": "Organizational design",
    "hrConsulting2": "Talent acquisition and retention",
    "hrConsulting3": "Performance management systems",
    "hrConsulting4": "Employee engagement strategies",
    "hrConsulting5": "Training and development programs",
    "hrConsulting6": "HR policy development",
    "hrConsulting7": "Succession planning",
    "hrConsulting8": "Compensation and benefits structuring",
    "humanResources": "Human Resources Management",
    "humanResourcesContent1": "Human resources management is crucial for the effective functioning of any organization.",
    "humanResourcesContent2": "Our HR consulting services are designed to help you build a strong and motivated workforce.",
    "humanResourcesContent3": "We offer expertise in:",
    "humanResourcesContent4": "Recruitment and Selection",
    "humanResourcesContent5": "Employee Development",
    "humanResourcesContent6": "Performance Management",
    "humanResourcesContent7": "Compensation and Benefits",
    "humanResourcesContent8": "Employee Relations",
    "humanResourcesContent9": "HR Policy Development",
    "humanResourcesContent10": "Workforce Planning",
    "humanResourcesContent11": "Compliance and Risk Management",
    "digitalTransformation": "Digital Transformation",
    "digitalTransformationContent1": "Digital transformation is the integration of digital technology into all areas of a business, fundamentally changing how you operate and deliver value to customers.",
    "digitalTransformationContent2": "We help organizations to innovate and transform their operations with our digital transformation services, which include:",
    "digitalTransformationContent3": "Digital Strategy Development",
    "digitalTransformationContent4": "Process Automation",
    "digitalTransformationContent5": "Data Analytics and Insights",
    "digitalTransformationContent6": "Customer Experience Enhancement",
    "digitalTransformationContent7": "Technology Implementation",
    "digitalTransformationContent8": "Cloud Computing",
    "digitalTransformationContent9": "Cybersecurity",
    "digitalTransformationContent10": "IT Infrastructure Management",
    "digitalTransformationContent11": "Change Management",
    "salesAndMarketing": "Sales and Marketing",
    "salesAndMarketingContent1": "Effective sales and marketing strategies are essential for business growth and customer retention.",
    "salesAndMarketingContent2": "Our sales and marketing consulting services are designed to help you achieve your business objectives.",
    "salesAndMarketingContent3": "We provide expertise in:",
    "salesAndMarketingContent4": "Market Research and Analysis",
    "salesAndMarketingContent5": "Brand Development",
    "salesAndMarketingContent6": "Digital Marketing",
    "salesAndMarketingContent7": "Sales Strategy",
    "salesAndMarketingContent8": "Customer Relationship Management",
    "salesAndMarketingContent9": "Marketing Communications",
    "salesAndMarketingContent10": "Product Management",
    "safetyAndHealth": "Safety and Health Management",
    "safetyAndHealthContent1": "Ensuring the safety and health of employees is a top priority for any organization.",
    "safetyAndHealthContent2": "We provide comprehensive safety and health management consulting services to help you create a safe and healthy work environment.",
    "safetyAndHealthContent3": "Our services include:",
    "safetyAndHealthContent4": "Risk Assessment and Management",
    "safetyAndHealthContent5": "Health and Safety Audits",
    "safetyAndHealthContent6": "Emergency Response Planning",
    "safetyAndHealthContent7": "Occupational Health Programs",
    "safetyAndHealthContent8": "Safety Training and Education",

    "missionTitle": "Our Mission",
    "missionSubtitle": "Your Business Development Partner",
    "missionDescription": "At A.M.H., our mission is to empower businesses through strategic insights and innovative solutions. We are committed to fostering growth, enhancing operational efficiencies, and maximizing opportunities for our clients. By delivering exceptional service and building enduring partnerships, we strive to be a catalyst for sustainable success in every industry we serve.",
    "missionAction": "Get in Touch",

    "visionTitle": "Our Vision",
    "visionDescription": "Our vision at A.M.H. is to lead the way in transformative business development. We aim to be recognized globally for our commitment to excellence, integrity, and customer satisfaction. Through continuous innovation and a collaborative approach, we aspire to set new standards in driving organizational growth and achieving unparalleled results for our clients.",
    "visionAction": "Discover More"
  },
  "WhoWeAre": {
    "heroTitle": "Empowering Business Development Excellence",
    "heroDescription": "A.M.H. involves leveraging strategic insights and fostering innovation to propel growth and success. Through tailored strategies, market expertise, and proactive solutions, we empower businesses to navigate challenges, seize opportunities, and achieve sustainable expansion. At A.M.H., we are dedicated to providing the tools and support necessary to elevate your business development efforts and drive impactful results in today's dynamic market.",
    "businessDevelopmentPrinciples": "Our Business Development Principles",
    "settingAboveTheStandard": "Setting above the Standard",
    "strategicAlignment": "Strategic Alignment",
    "strategicAlignmentDesc": "A.M.H. prioritizes strategic alignment by ensuring every business development initiative directly supports our long-term goals and enhances our competitive edge. This approach allows us to focus resources effectively, capitalize on market opportunities, and navigate challenges with clarity and purpose.",
    "customerCentricFocus": "Customer-Centric Focus",
    "customerCentricFocusDesc": "At A.M.H., understanding and meeting client needs is paramount. We actively engage with clients to gain deep insights into their challenges and goals. By tailoring our solutions and services accordingly, we foster strong client relationships built on trust, satisfaction, and a commitment to delivering meaningful value.",
    "relationshipCultivation": "Relationship Cultivation",
    "relationshipCultivationDesc": "We place significant emphasis on cultivating and nurturing relationships with clients, partners, and stakeholders. By fostering open communication, collaboration, and mutual respect, we create opportunities for strategic alliances and synergies. These partnerships not only expand our reach but also enrich our capabilities and industry insights.",
    "innovationAndAdaptability": "Innovation and Adaptability",
    "innovationAndAdaptabilityDesc": "A.M.H. embraces innovation as a catalyst for growth and differentiation. We encourage a culture of creativity and continuous improvement, leveraging emerging technologies and industry trends to stay ahead. Our adaptable approach enables us to respond swiftly to market shifts, seize new opportunities, and maintain relevance in a competitive landscape.",
    "dataDrivenDecisionMaking": "Data-Driven Decision Making",
    "dataDrivenDecisionMakingDesc": "Data is integral to A.M.H.'s decision-making process. We harness data analytics and market intelligence to inform strategic choices, optimize performance, and mitigate risks. By leveraging actionable insights, we enhance our ability to forecast trends, measure success, and refine our business development strategies for sustained growth and profitability.",

    "innovativeBusinessDevelopment": "Innovative Business Development",
    "unmatched": "Unmatched",
    "marketSpecificSolutionsCount": "12+",
    "marketSpecificSolutions": "Market-Specific Solutions",
    "successfulClientEngagementsCount": "2,500+",
    "successfulClientEngagements": "Successful Client Engagements",
    "positiveClientFeedbackPercentage": "98%",
    "positiveClientFeedback": "Positive Client Feedback",
    "innovativeDescription": "At A.M.H we excel in providing innovative solutions tailored to meet the needs of business development. Our seasoned experts bring unparalleled insights and expertise, resulting in a proven track record of successful client engagements. We are proud to receive overwhelmingly positive feedback from our clients, reinforcing our commitment to excellence.",

    "trustedCollaborations": "Trusted Collaborations"
  },
  "OurTeam": {
    "title": "Our Team",
    "subtitle": "Dedication. Expertise. Passion."
  }
}
